app/controllers/articles_controller.rb

 def update
   @article = Article.find(params[:id])
    @post.update(params.require(:article))
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-01-11 19:35:09.152461"], ["id", 1]]